dioptre/eclipse/plugins/org.eclipse.cdt.embsysregview.data_0.2.6.r191/data/SVD(CMSIS)/AnalogDevices/ADuCM350_svd.xml
      </registers>
  </peripheral>
  <peripheral>
			<name>ADI_GPT0</name>
			<description>General purpose Timer 0</description>
			<groupName>GPT0</groupName>
			<baseAddress>0x40000000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>GP-TIMER0</name>
				<value>11</value>
			</interrupt>
			<registers>
				<register>
					<name>GPT0LD</name>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000010</size>
					<fields>
						<field>
							<name>VALUE</name>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>GPT0VAL</name>
					<addressOffset>0x00000004</addressOffset>
					<size>0x00000010</size>
					<fields>
						<field>
							<name>VALUE</name>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>GPT0CON</name>
					<addressOffset>0x00000008</addressOffset>
					<size>0x00000010</size>
				<!--	<description>Control Register</description>-->
					<fields>
						<field>
							<name>EVENTEN</name>
							<description>Enable time capture of an event</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EVENT</name>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>WUT_SRC</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXT0</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXT1</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXT2</name>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXT3</name>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXT4</name>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXT5</name>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXT6</name>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXT7</name>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXT8</name>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reserved</name>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CapTouch</name>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WDT</name>
									<value>12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Flash_controller</name>
									<value>13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Timer_1</name>
									<value>14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Timer_2</name>
									<value>15</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RLD</name>
							<description>Timer reload on write to clear register</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLK</name>
							<description>Clock Select</description>
							<bitOffset>5</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>PCLK</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HFOSC</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFOSC</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFXTAL</name>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ENABLE</name>
							<description>Enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MOD</name>
						<!--	<description>Mode</description>-->
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>FREERUN</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PERIODIC</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UP</name>
							<description>Count-up</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
									<!--<description>- counter is set to count down</description>-->
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
							<!--		<description>- counter is set to count up</description>-->
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PRE</name>
							<description>Prescaler</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
									<value>0</value>
								<!--	<description>- If the selected clock source is 0 or 1 then this setting results in a prescaler of 4.</description>-->
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV16</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV256</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV32768</name>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GPT0CLRI</name>
					<addressOffset>0x0000000C</addressOffset>
					<size>0x00000010</size>
					<!--<description>Clear interrupt register</description>-->
					<fields>
						<field>
							<name>CAP</name>
							<description>Clear captured event interrupt</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TMOUT</name>
							<description>Clear timeout interrupt</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GPT0CAP</name>
					<addressOffset>0x00000010</addressOffset>
					<size>0x00000010</size>
				<!--	<description>Capture Register</description>-->
					<fields>
						<field>
							<name>VALUE</name>
					<!--		<description>Capture value</description>-->
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>GPT0ALD</name>
					<addressOffset>0x00000014</addressOffset>
					<size>0x00000010</size>
				<!--	<description>Load Value, Asynchronous Register</description>-->
					<fields>
						<field>
							<name>ALOAD</name>
							<description>Value updated in the timer clock domain</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>GPT0AVAL</name>
					<addressOffset>0x00000018</addressOffset>
					<size>0x00000010</size>
				<!--	<description>Counter Value, Asynchronous Register</description>-->
					<fields>
						<field>
							<name>AVAL</name>
							<description>Counter Value (current)</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>GPT0STA</name>
					<addressOffset>0x0000001C</addressOffset>
					<size>0x00000010</size>
			<!--		<description>Status Register</description>-->
					<fields>
						<field>
							<name>PDOK</name>
							<description>GPTCLRI[0] is updated in the timer clock domain</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BUSY</name>
							<description>Timer busy. Check after writing GPTCON.</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>READY</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NOT_READY</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAP</name>
							<description>Capture event pending</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TMOUT</name>
							<description>Time out event occurred</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GPT0PCON</name>
					<addressOffset>0x00000020</addressOffset>
					<size>0x00000010</size>
					<!--<description>PWM Control Register</description>-->
					<fields>
						<field>
							<name>IDLE_STATE</name>
							<description>PWM idle state</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
              <enumeratedValues>
								<enumeratedValue>
									<name>IDLE_LOW</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IDLE_HIGH</name>
									<value>1</value>
								</enumeratedValue>								
							</enumeratedValues>
						</field>
						<field>
							<name>MATCH_EN</name>
							<description>PWM match enabled</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
              <enumeratedValues>
								<enumeratedValue>
									<name>PWM_TOGGLE</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM_MATCH</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GPT0PMAT</name>
					<addressOffset>0x00000024</addressOffset>
					<size>0x00000010</size>
				<!--	<description>PWM Match Value Register</description>-->
					<fields>
						<field>
							<name>MATCH_VAL</name>
							<description>PWM Match Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
