dioptre/eclipse/plugins/org.eclipse.cdt.embsysregview.data_0.2.6.r191/data/SVD(CMSIS)/AnalogDevices/ADuCM350_svd.xml
			</registers>
		</peripheral>
  <peripheral>
			<name>ADI_GPT2</name>
			<description>General purpose Timer 2</description>
			<groupName>GPT2</groupName>
			<baseAddress>0x40000800</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>GP-TIMER2</name>
				<value>40</value>
			</interrupt>
			<registers>
				<register>
					<name>GPT2LD</name>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000010</size>
					<!--<description>16-bit load value</description>-->
					<fields>
						<field>
							<name>VALUE</name>
							<description>Load value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>GPT2VAL</name>
					<addressOffset>0x00000004</addressOffset>
					<size>0x00000010</size>
					<!--<description>"16-bit timer value, read only."</description>-->
					<fields>
						<field>
							<name>VALUE</name>
							<description>Current value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>GPT2CON</name>
          <description>Control Register</description>
					<addressOffset>0x00000008</addressOffset>
					<size>0x00000010</size>
					<fields>
						<field>
							<name>EVENTEN</name>
							<description>Enable time capture of an event</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EVENT</name>
							<description>Event select range. Timer event select range (0 to 15).</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>EXT0</name>
									<value>0</value>
							<!--		<description>- External interrupt 0</description>-->
								</enumeratedValue>
								<enumeratedValue>
									<name>EXT1</name>
									<value>1</value>
								<!--	<description>- External interrupt 1</description>-->
								</enumeratedValue>
								<enumeratedValue>
									<name>EXT2</name>
									<value>2</value>
								<!--	<description>- External interrupt 2</description>-->
								</enumeratedValue>
								<enumeratedValue>
									<name>EXT3</name>
									<value>3</value>
								<!--	<description>- External interrupt 3</description>-->
								</enumeratedValue>
								<enumeratedValue>
									<name>EXT4</name>
									<value>4</value>
							<!--		<description>- External interrupt 4</description>-->
								</enumeratedValue>
								<enumeratedValue>
									<name>EXT5</name>
									<value>5</value>
						<!--			<description>- External interrupt 5</description>-->
								</enumeratedValue>
								<enumeratedValue>
									<name>EXT6</name>
									<value>6</value>
							<!--		<description>- External interrupt 6</description>-->
								</enumeratedValue>
								<enumeratedValue>
									<name>EXT7</name>
									<value>7</value>
									<!--<description>- External interrupt 7</description>-->
								</enumeratedValue>
								<enumeratedValue>
									<name>EXT8</name>
									<value>8</value>
								<!--	<description>- External interrupt 8</description>-->
								</enumeratedValue>
								<enumeratedValue>
									<name>AFE_generation</name>
									<value>9</value>
								<!--	<description>- Afe: generation</description>-->
								</enumeratedValue>
								<enumeratedValue>
									<name>CapTouch</name>
									<value>10</value>
								<!--	<description>- Capacitive touch</description>-->
								</enumeratedValue>
								<enumeratedValue>
									<name>RTC</name>
									<value>11</value>
								<!--	<description>- Realtime clock</description>-->
								</enumeratedValue>
								<enumeratedValue>
									<name>AFE_cmd_Fifo</name>
									<value>12</value>
								<!--	<description>-AFE command fifo</description>-->
								</enumeratedValue>
								<enumeratedValue>
									<name>AFE_data_fifo</name>
									<value>13</value>
								<!--	<description>- AFE data fifo</description>-->
								</enumeratedValue>
								<enumeratedValue>
									<name>Timer_0</name>
									<value>14</value>
							<!--		<description>- Timer 0</description>-->
								</enumeratedValue>
								<enumeratedValue>
									<name>Timer_1</name>
									<value>15</value>
					<!--				<description>- Timer 1</description>-->
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RLD</name>
							<description>Timer reload on write to clear register</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLK</name>
							<description>Clock Select</description>
							<bitOffset>5</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>PCLK</name>
									<value>0</value>
								<!--	<description>- Peripheral Clock</description>-->
								</enumeratedValue>
								<enumeratedValue>
									<name>HFOSC</name>
									<value>1</value>
									<!--<description>- 16 MHz internal oscillator</description>-->
								</enumeratedValue>
								<enumeratedValue>
									<name>LFOSC</name>
									<value>2</value>
									<!--<description>- Internal 32 kHz Oscillator</description>-->
								</enumeratedValue>
								<enumeratedValue>
									<name>LFXTAL</name>
									<value>3</value>
									<!--<description>- External 32 kHz crystal</description>-->
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ENABLE</name>
							<description>Enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MOD</name>
							<description>Mode</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>FREERUN</name>
									<value>0</value>
									<!--<description>- counter starts at 0x0000 or 0xFFFF</description>-->
								</enumeratedValue>
								<enumeratedValue>
									<name>PERIODIC</name>
									<value>1</value>
						<!--			<description>- counter starts at LOAD value</description>-->
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UP</name>
							<description>Count-up</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
									<!--<description>- counter is set to count down</description>-->
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
							<!--		<description>- counter is set to count up</description>-->
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PRE</name>
							<!--<description>Prescaler</description>-->
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
									<value>0</value>
								<!--	<description>- If the selected clock source is 0 or 1 then this setting results in a prescaler of 4.</description>-->
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV16</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV256</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV32768</name>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GPT2CLRI</name>
					<description>Clear interrupt register</description>
					<addressOffset>0x0000000C</addressOffset>
					<size>0x00000010</size>
					<fields>
						<field>
							<name>CAP</name>
							<!--<description>Clear captured event interrupt</description>-->
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TMOUT</name>
							<!--<description>Clear timeout interrupt</description>-->
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GPT2CAP</name>
					<description>Capture Register</description>
					<addressOffset>0x00000010</addressOffset>
					<size>0x00000010</size>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Capture value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>GPT2ALD</name>
					<description>Load Value, Asynchronous Register</description>
					<addressOffset>0x00000014</addressOffset>
					<size>0x00000010</size>
					<fields>
						<field>
							<name>ALOAD</name>
							<description>Value updated in the timer clock domain</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>GPT2AVAL</name>
					<description>Counter Value, Asynchronous Register</description>
					<addressOffset>0x00000018</addressOffset>
					<size>0x00000010</size>
					<fields>
						<field>
							<name>AVAL</name>
							<description>Counter Value (current)</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>GPT2STA</name>
					<description>Status Register</description>
					<addressOffset>0x0000001C</addressOffset>
					<size>0x00000010</size>
					<fields>
						<field>
							<name>PDOK</name>
							<description>GPTCLRI[0] is updated in the timer clock domain</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BUSY</name>
							<description>Timer busy. Check after writing GPTCON.</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>READY</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NOT_READY</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAP</name>
							<description>Capture event pending</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TMOUT</name>
							<description>Time out event occurred</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GPT2PCON</name>
          <description>PWM Control Register</description>
					<addressOffset>0x00000020</addressOffset>
					<size>0x00000010</size>
					<fields>
						<field>
							<name>IDLE_STATE</name>
							<description>PWM idle state</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
              <enumeratedValues>
								<enumeratedValue>
									<name>IDLE_LOW</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IDLE_HIGH</name>
									<value>1</value>
								</enumeratedValue>								
							</enumeratedValues>
						</field>
						<field>
							<name>MATCH_EN</name>
							<description>PWM match enabled</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
              <enumeratedValues>
								<enumeratedValue>
									<name>PWM_TOGGLE</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM_MATCH</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GPT2PMAT</name>
						<description>PWM Match Value Register</description>
					<addressOffset>0x00000024</addressOffset>
					<size>0x00000010</size>
					<fields>
						<field>
							<name>MATCH_VAL</name>
							<description>PWM Match Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
